package YAO.GreenLife.core;

public class ImageNetClasses {
    public static final String TAG = "GreenLifeResNet18";
    public static String[] IMAGENET_CLASSES = new String[]{
            "稻叶毛虫",
            "米水象鼻虫",
            "七星瓢虫",
            "米虫",
            "蝼蛄",
            "黄色地老虎",
            "蚜虫",
            "麦蜘蛛",
            "腐烂茎线虫",
            "小麦锯蝇",
            "甜菜象鼻虫",
            "草地蛾",
            "芫菁",
            "牛角花齿蓟马",
            "蝗虫",
            "东方菜粉蝶",
            "刺蛾",
            "十星瓢萤叶甲",
            "大青叶蝉",
            "柑橘凤蝶",
            "枯叶夜蛾",
            "茶树白蛾蜡蝉"
    };


    public static String[] IMAGENET_CLASSES_INTRODUCTION = new String[]{
            "稻叶毛虫(rice leaf caterpillar)色彩美丽，成虫体肢和翅满被鳞片和毛，故2对翅为鳞翅，且前翅大于后翅；虹吸式口器（原始的小翅蛾类上颚发达，为咀嚼式）；触角丝状、双栉状、栉状、棍棒状等多型；复眼发达，单眼2个或无单眼。幼虫蠕虫状，具3对胸足，腹足和尾足大多为5对。毛毛虫掉到人身上，其众多的刺毛接触皮肤后可断折，毛腔内的毒液便注入皮内，因毒毛的毛腔内充满毒液可引起皮肤剧烈瘙痒与疼痛，有时痛得像被火烧一样。被蛰伤的皮肤中心可有小丘疹，痒痛症状可持续数小时或更久。毛毛虫皮炎是在某一部位出现大小一致、且数量较多的红色丘疹。",
            "象鼻虫(rice water weevil)是鞘翅目昆虫中最大的一科，也是昆虫王国中种类最多的一种，全世界已知的种类已超过6万种，在我国种类可达6000多种。象鼻虫”祖籍西非大陆，体躯很小，头上长着一根触须，因形似象鼻故而得名 [1]  。大多数种类都有翅，体长大致在0.1公分到10公分左右。其中“鼻子”占了身体的一半。看到这类昆虫令人不由得想起大象的长鼻子，因为它们的口吻很长，所以这类昆虫被人们称为象鼻虫。不过可别把长型的囗吻当成象鼻虫的鼻子，何况看生于末端的并不是鼻子，而是它们用以嚼食食物的口器。当然除了口吻长外，拐角着生于吻基部也是此虫的特色之一。",
            "七星瓢虫（Coccinella septempunctata）是瓢虫科、瓢虫属昆虫。成虫体长5.2-6.5毫米，宽4.0-5.6毫米；身体卵圆形，背部拱起，呈水瓢状；头黑色、复眼黑色，内侧凹入处各有一淡黄色点；触角褐色；口器黑色；上额外侧为黄色；前胸背板黑，前上角各有1个较大的近方形的淡黄地；小盾片黑色；鞘翅红色或橙黄色，两侧共有7个黑斑，左右两侧各有3个黑点，接合处前方尚有一个更大的黑点；翅基部在小盾片两侧各有1个三角形白斑；体腹及足黑色\n七星瓢虫一生要经过卵、幼虫、蛹和成虫4个不同发育阶段，各虫态的发育历期，主要受食物和温度的影响。七星瓢虫是迁飞性昆虫，成虫和幼虫的觅食行为属于广域搜索与区域集中搜索行为的转换。七星瓢虫主要以蚜虫为食，有时还取食小土粒、真菌孢子和一些小型昆虫，秋天还常常取食植物的花粉。广泛分布于非洲、欧洲、亚洲。",
            "米虫(rice shell pest)指大米里的蛀虫，学名为米象，常在谷物中被发现，因为繁殖速度快，为谷物中主要的害虫之一。其主要寄主在玉米、稻米、小麦、高粱、面粉、等各种贮藏的谷物中，木地板的家庭出现的也较多。",
            "蝼蛄(Gryllotalpa spps)是节肢动物门，昆虫纲，直翅目，蟋蟀总科，蝼蛄科昆虫的总称。蝼蛄俗名拉拉蛄，地拉蛄，天蝼，土狗等，是药用昆虫。我国大陆上常见的分布较广的蝼蛄有5种，分别是华北蝼蛄（Gryllotalpa unispina Saussure）、东方蝼蛄（Gryllotalpa orientalis Burmeister）、金秀蝼蛄（Gryllotalpa jinxiuensis You & Li）、河南蝼蛄（Gryllotalpa henana Cai & Niu）和台湾蝼蛄（Gryllotalpa formosana Shiraki）。一般入药的主要是华北蝼蛄和东方蝼蛄。药用通常为蝼蛄科昆虫蝼蛄的干燥成虫和大个若虫全体\n华北蝼蛄主要分布在北方各地，东方蝼蛄在中国各地均有分布，南方危害较重。台湾蝼蛄发生于台湾、广东、广西。普通蝼蛄仅分布在新疆",
            "黄地老虎(yellow cutworm) ，夜蛾科地夜蛾属的一个物种。成虫体长14～19毫米，翅展32～43毫米。全体黄褐色。前翅亚基线及内、中、外横纹不很明显；肾形纹、环形纹和楔形纹均甚明显，各围以黑褐色边，后翅白色，前缘略带黄褐色。卵半圆形，底平，直径约0.5毫米",
            "蚜虫(aphids)，又称腻虫、蜜虫，是一类植食性昆虫，包括蚜总科（又称蚜虫总科，学名：Aphidoidea）下的所有成员。已经发现的蚜虫总共有10个科约4400种，其中多数属于蚜科。\n蚜虫也是地球上最具破坏性的害虫之一。 其中大约有250种是对于农林业和园艺业危害严重的害虫。蚜虫的大小不一，身长从一到十毫米不等。\n蚜虫的天敌有瓢虫、食蚜蝇、寄生蜂、食蚜瘿蚊（aphid midge larvae）、蟹蛛、草蛉以及昆虫病原真菌（entomopathogenic fungi，含绿僵菌）。\n蚜虫在世界范围内的分布十分广泛，但主要集中于温带地区。另外，物种的多样性在热带比在温带要低得多。蚜虫可以进行远程迁移，主要是通过随风飘荡的形式来进行扩散；例如，莴苣蚜虫被认为就是通过这种方式从新西兰传播到塔斯马尼亚。而一些人类活动也可以帮助蚜虫的迁移，例如对附着蚜虫的植物进行运输的过程。",
            "麦蜘蛛(longlegged spider mite)属蛛形纲，蜱螨目。国内危害小麦的螨类主要由麦圆蜘蛛与麦长腿蜘蛛两种。前者属真足螨科。麦圆蜘蛛发生在北纬37度至29之间的冬麦区；麦长腿蜘蛛分布偏北，主要发生在北纬34至43度的小麦产区。在安徽省多数地区发生危害的是麦圆蜘蛛，皖北部地区如砀山，两种麦蜘蛛混合发生。两种麦蜘蛛主要危害小麦，大麦受害轻。麦蜘蛛在小麦苗期吸食叶汁液。被害叶上初现许多细小白斑，以后麦叶变黄。麦株受害后轻者影响生长，植株矮小，产量降低，重者全株干枯死亡。麦圆蜘蛛危害盛期在小麦拔节阶段，小麦受害后如及时浇水追肥，可显著减轻受害程度。麦长腿蜘蛛危害盛期在小麦孕穗至抽穗期，大可发生时可造成严重减产\n在中国小麦产区常见的麦蜘蛛主要有两种：麦长腿蜘蛛和麦圆蜘蛛。两种麦蜘蛛于春秋两季吸取麦株汁液，被害麦叶先呈白斑，后变黄，轻则影响小麦生长，造成植株矮小，穗少粒轻，重则整株干枯死亡。株苗严重被害后，抗害力显著降低。",
            "腐烂茎线虫(wheat phloeothrips)是多食性线虫，已报道的植物寄主多达90多种。马铃薯是其主要寄主，其他的重要寄主作物有甘薯、洋葱、大蒜、鸢尾、郁金香等。是马铃薯的最重要病害。在不加防治的情况下，对甘薯和人参的为害有时是毁灭性的，可以造成绝产。",
            "小麦锯蝇(wheat sawfly)是一种原生的食草昆虫，长期以来一直对北部平原的春小麦生产构成威胁。然而，在 1980 年代初期，它也成为冬小麦的一种重要害虫。从那时起，冬小麦中的锯蝇侵扰已经从北达科他州和蒙大拿州蔓延到怀俄明州东南部、内布拉斯加州狭长地带，以及最近的科罗拉多州东北部。2010 年，科罗拉多州首次报告了冬小麦受损情况，该地区位于韦尔德县的科罗拉多 14 号公路沿线。从那时起，就发现它在南至巴卡县的冬小麦中滋生。",
            "成虫体长12～16毫米，黑色，密披灰白色鳞片。喙前端稍膨大，鞘翅中部有黑色带状斑,卵长约1.2毫米、宽约1毫米,椭圆形,初产时乳白色,后渐变为浅黄色。老熟幼虫体长约12.5毫米,乳白色，头黄褐色,无足，向腹部弯曲。蛹长约10～15毫米，浅黄至黄红色。\n除甜菜外，还为害玉米、烟草、向日葵，也喜食苋菜等。\n成虫取食子叶和小的真叶造成缺刻，严重发生时，可将其全部吃光，且咬断幼茎，造成严重缺苗断垄或大面积毁种。幼虫取食甜菜根部，咬成凹穴，致叶部衰萎，影响块根正常生长，重则死亡。",
            "草地贪夜蛾(Spodoptera frugiperda)：是夜蛾科灰翅夜蛾属的一种蛾。成虫在夜间活动，在植物叶子顶部产约100粒卵，卵阶段是在25℃的温度下持续3天。新孵出的幼虫以卵壳本身为食，然后静置2-10小时。幼虫即毛毛虫更喜欢以新叶为食，由于它们的食性习惯，通常会各自找到一片新叶。幼虫改变皮肤七次，并在最后的一次离开墨囊，穿透0.5厘米深的土壤，在那里它们变成蛹。蛹阶段在一年中最热的时期持续约10-12天。成虫的寿命约为12天，该有害生物的完整周期仅为30天。",
            "芫菁(blister beetle) 鞘翅目(Coleoptera)芫菁科(Meloidae)甲虫，约2,500种，会分泌出一种刺激性物质，称「斑蝥素」(cantharidin)，主要是从斑蝥属(Mylabris)和欧洲的西班牙芫菁(Lytta vesicatoria, 俗称西班牙苍蝇)收集而来。斑蝥素可用作一种局部皮肤发炎药剂，以除去皮疣。在过去，引出芫菁来医治许多病痛是一种普遍作法，斑蝥素常用来治病。它还是所谓的「春药」的主要成分。芫菁对人类既有益又有害，幼虫食蝗卵，而如果数量很多，成虫就会危害作物。",
            "牛角花齿蓟马(odontothrips loti)是我国北方为害苜蓿的重要害虫之一,严重影响苜蓿的产量与质量。\n牛角花齿蓟马，成虫体长1.3~1.6mm,体暗黑色,但触角第3节、3对足的跗节及第1对足的胫节为黄色。前翅有黄色和淡黑色斑纹,前翅基部近1/4部分为黄色,形成两个黄色斑,中部为淡黑色,之后为淡黄色,到翅端为淡黑色。卵肾形,半透明,微黄色,长0.2mm,宽0.1mm若虫共有4龄,淡黄色,4龄若虫又称伪蛹",
            "蝗虫(Locustoidea)，俗称“蚂蚱”，属直翅目，包括蚱总科（Tetrigoidea）、蜢总科（Eumastacoidea）、蝗总科（Locustoidea）的种类，全世界有超过10000种，我国有1000余种，分布于全世界的热带、温带的草地和沙漠地区。蝗虫主要包括飞蝗和土蝗。在我国飞蝗有东亚飞蝗（Locusta migratoria manilensis (Meyen)）、亚洲飞蝗（Locusta migratoria migratoria (Linnaeus)）和西藏飞蝗（Locusta migratoria tibitensis Chen）3种，其中东亚飞蝗在我国分布范围最广，危害最严重，是造成我国蝗灾的最主要飞蝗种类，主要危害禾本科植物，是农业害虫。\n蝗虫食物范围广，可取食小麦、水稻、谷子、玉米、豆类、烟草、芦苇、蔬菜、果树、林木及杂草的叶子、嫩茎、花蕾和嫩果等，将叶片咬成缺刻或孔洞，大发生时可将作物食成光杆或全部吃净，造成严重经济损失。",
            "东方菜粉蝶(Pieris canidia)，是粉蝶科粉蝶属的一种蝴蝶。飞行缓慢，雪白的翅膀和前翅上有淡淡的黑斑，令它们显得份外优雅。它们的幼虫嗜吃十字花科、及白花菜科植物，被视为农业害虫。 在江西以蛹越冬；越冬代成虫一般在4月上旬开始羽化。一年发生6—8代。 主要分布在中国各省区；韩国，越南，老挝，缅甸，柬埔寨，泰国，土耳其。",
            "刺蛾(Limacodidae)；鳞翅目的一科。俗称痒辣子、火辣子、八架子、双木架子或刺毛虫。世界记载有1000种，中国记录约90种。由于这类幼虫体上有枝刺和毒毛，触及皮肤立即发生红肿，疼痛异常。\n刺蛾成虫中等大小，身体和前翅密生绒毛和厚鳞，大多黄褐色、暗灰色和绿色，间有红色，少数底色洁白，具斑纹。夜间活动，有趋光性。口器退化，下唇须短小，少数较长。雄蛾触角一般为双栉形，翅较短阔。幼虫体扁，蛞蝓形，其上生有枝刺和毒毛，有些种类较光滑无毛或具瘤。头小可收缩。有些种类茧上具花纹，形似雀蛋。羽化时茧的一端裂开圆盖飞出。刺蛾幼虫大多取食阔叶树叶，少数为害竹竿和水稻，是森林、园林、行道树、果园和多种经济植物（如咖啡、茶和桑等）的常见害虫。",
            "十星瓢萤叶甲(Oides decempunctata)又名葡萄十星叶甲。属鞘翅目,叶甲科。主要分布于日本、朝鲜、越南及中国。在国内各地均有发生。寄主有葡萄、野葡萄、爬墙虎等。幼虫和成虫食害葡萄芽和叶。叶片常被吃成孔洞,严重时叶肉全被食尽,仅留一些绒毛及叶脉成虫土黄色,椭圆形。体长12~13mm,头部甚小,大部缩入前胸内。触角丝状,淡黄色,末端3节及第四节端部黑褐色。前胸背板上密布细刻点。两鞘翅上共有黑色圆斑10个。卯椭圆形,长约1mm初为黄绿色,后渐变为暗褐色表面有很多不规则的小突起。幼虫末龄幼虫体长12~15血m,体扁而肥,近长椭圆形。头部小,黄褐色。胸、腹部淡黄至土黄色。除前胸和尾节外,各节背板均有两横列黑斑,中后胸每列各4个,腹部前列4个后列6个。除尾节外,各节两侧均具肉质突起3个,突起顶端黑褐色",
            "大青叶蝉（学名：Cicadella viridis）属同翅目叶蝉科，体长约7-11mm，在世界各地广泛分布，最多可年生5代。大青叶蝉危害多种植物的叶、茎，使其坏死或枯萎，此外，还可传染毒病。可以实行人工、药物捕杀，或利用其趋光性将其诱杀。\n寄主包括杨、柳、白蜡、刺槐、苹果、桃、梨、桧柏、梧桐、扁柏、粟（谷子）、玉米、水稻、大豆、马铃薯等160多种植物。\n大青叶蝉的为害特点是成虫和若虫为害叶片，刺吸汁液，造成褪色、畸形、卷缩，甚至全叶枯死。此外，还可传播病毒病。",
            "柑橘凤蝶（学名：Papilio xuthus）是凤蝶科，凤蝶属的蝴蝶。体、翅的颜色随季节不同而变化，翅上的花纹黄绿色或黄白色。前翅中室基半部有放射状斑纹4-5条，到端部断开几乎相连，端半部有2个横斑；外缘排列十分整齐而规则。后翅基半部的斑纹都是顺脉纹排列，被脉纹分割；在亚外缘区有1列蓝色斑，有时不十分明显；外缘区有1列弯月形斑纹，臀角有1个环形或半环形红色斑纹。翅反面色稍淡，前、后翅亚外区斑纹明显，其余与正面相似。\n成虫有访花习惯，经常在湿地吸水或花间采蜜。一生经过卵、幼虫、蛹、成虫4个阶段，是完全变态的昆虫。\n该种尚未列入世界自然保护联盟（IUCN）《濒危物种红色名录》ver3.1。",
            "枯叶夜蛾(Adristyrannus)，昆虫名，为鳞翅目，夜蛾科。分布于江西、上海、台湾、湖北、云南、贵州、河南、安徽、辽宁、内蒙古等省。为害柑橘、苹果、葡萄、枇杷、杧果、梨、桃、杏、李、柿等植物的果实。成虫以锐利的虹吸式口器穿刺果皮。果面留有针头大的小孔，果肉失水呈海绵状，以手指按压有松软感觉，被害部变色凹陷、随后腐烂脱落。常招致胡蜂等为害，将果实食成空壳。\n农业防治：合理规划苗圃，新建苗圃时，尽可能远离果园。\n人工防治：在成虫产卵、幼虫孵化期，加以捕杀。\n铲除苗圃周围的木防己、通草等寄主植物。\n灯光诱杀成虫，在成虫高发期，根据成虫具有趋光性，安装黑光灯或频振式杀虫灯进行诱杀\n药剂防治：在成虫产卵后，幼虫孵化后，及时喷施杀虫剂进行防治。常用药剂有90%晶体敌百虫800～1 000倍，4.5%高效氯氰菊酯乳油1 500倍液，防治效果可达到95%以上。\n生物防治：注意保护利用天敌。",
            "茶树白蛾蜡蝉(Lawana imitata Melichar)，昆虫名，为同翅目，蛾蜡蝉科。分布偏南，北限未过南岭，近年浙江缙云、湖南宜章、湖北武汉时有发生。寄主植物为茶、油茶、柑橘、荔枝、龙眼、芒果、桃、李、梅、木菠萝、咖啡、石榴、无花果、木瓜、梨、胡椒等。成、若虫吸食枝条和嫩梢汁液，使其生长不良，叶片萎缩而弯曲，重者枝枯果落，影响产量和质量。排泄物可诱致煤污病发生。\n吸食荔枝、龙眼等果树林木枝叶汁液的害虫。学名Lawana imitata Melichar。同翅目，蛾蜡蝉科。分布于印度及中国广东、广西、福建、云南、台湾等省区。为害柑橘、荔枝、龙眼、杧果、胡椒、茶、木菠萝、梅、李、桃、梨、木麻黄、银桦等几十种果树和林木。成虫和若虫吸食枝条汁液，使嫩梢生长不良，叶片萎缩而弯曲；幼茎被害，引起脱落，排泄的粪便可诱发煤烟霉病。成虫体长16．5～21．3毫米，碧绿或黄白色，被白色蜡粉。头尖，复眼黑褐色。触角基节膨大，其余各节呈刚毛状，中胸背板上有3条隆脊。前翅淡绿色或黄白色，有蜡光，翅脉分枝多，横脉密，形成网状，外缘平直，臀角尖锐突出；径脉和臀脉中段黄色，臀脉中段分支处分泌蜡粉较多，集中在翅室前端成一小点。后翅为碧玉色或淡黄色，半透明。卵长椭圆形，淡黄白色，表面有细网纹，常互相连接排成一列。若虫全体布满棉絮状的蜡质物。\n防治方法:(1)剪除有虫枝条，集中烧毁。\n(2)用捕虫网捕杀成虫，用扫把刷掉若虫，集中处理。\n(3)为害期药剂防治于成虫产卵前、产卵初期或若虫初孵群集未分散期施药为宜，用药种类和方法参见碧蛾蜡蝉。"};
}
